# Pandas Tutorial

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [6]:
df1 = pd.DataFrame([[1,5,2,9],[34,76,12,97],[23,76,34,86],[23,76,54,11],[126,25,64,92],[53,876,123,543],[54,321,987,345]])
df1

     0    1    2    3
0    1    5    2    9
1   34   76   12   97
2   23   76   34   86
3   23   76   54   11
4  126   25   64   92
5   53  876  123  543
6   54  321  987  345

In [7]:
df1.head(3)

    0   1   2   3
0   1   5   2   9
1  34  76  12  97
2  23  76  34  86

In [8]:
df1.tail(4)

     0    1    2    3
3   23   76   54   11
4  126   25   64   92
5   53  876  123  543
6   54  321  987  345

In [9]:
df1.shape

(7, 4)

In [10]:
df1.iloc[1:3,1:4]

    1   2   3
1  76  12  97
2  76  34  86

## Building DataFrames with Pandas

### From Python Dictionaries

In [11]:
list1 = ['S1','S2','S3','S4','S5']
Maths = [98,87,98,78,82]
Physics = [78,89,100,97,89]
Chemistry = [56,76,87,76,98]
title = ['ID','Maths','Physics','Chemistry']
values = [list1, Maths, Physics, Chemistry]
result = list(zip(title,values))
print(result)

[('ID', ['S1', 'S2', 'S3', 'S4', 'S5']), ('Maths', [98, 87, 98, 78, 82]), ('Physics', [78, 89, 100, 97, 89]), ('Chemistry', [56, 76, 87, 76, 98])]

In [12]:
result1 = dict(result)
df2 = pd.DataFrame(result1)
df2

   ID  Maths  Physics  Chemistry
0  S1     98       78         56
1  S2     87       89         76
2  S3     98      100         87
3  S4     78       97         76
4  S5     82       89         98

## Importing data

### DataFrames from CSV files

In [19]:
df3 = pd.read_csv('F:\\Programming\\Git_Materials\\DataHouse\\data.csv')
df3

,INSTRUMENT,SYMBOL,OPEN_PRICE,HI_PRICE,LO_PRICE,CLOSE_PRICE,OPEN_INT,TRD_VAL,TRD_QTY,NO_OF_CONT,NO_OF_TRADE
0,FUTIDX,BANKNIFTY,29375.50,29608.00,28820.00,28912.05,1751025,2.410000e+11,8233350,329334,231443
1,FUTIDX,BANKNIFTY,29410.05,29635.90,28849.95,28944.65,263975,1.333577e+10,455425,18217,13694
2,FUTIDX,BANKNIFTY,29879.95,29879.95,28864.20,28951.75,38925,1.510821e+09,51650,2066,1404
3,FUTIDX,NIFTY,12857.70,12976.25,12753.00,12793.50,11622900,1.690000e+11,13082775,174437,120635
4,FUTIDX,NIFTY,12897.45,12989.70,12777.35,12811.60,2042025,1.542744e+10,1196025,15947,12190
...,...,...,...,...,...,...,...,...,...,...,...
390,FUTSTK,WIPRO,344.10,348.15,341.35,342.00,6352000,1.998892e+09,5811200,1816,1290
391,FUTSTK,WIPRO,345.50,347.25,343.00,343.00,115200,3.645296e+07,105600,33,33
392,FUTSTK,ZEEL,189.30,192.50,185.65,186.95,32193000,2.278077e+09,12021000,4007,3719
393,FUTSTK,ZEEL,189.85,193.00,186.40,187.55,2694000,6.321768e+08,3321000,1107,962
394,FUTSTK,ZEEL,192.20,193.00,187.50,187.65,96000,8.546400e+06,45000,15,15

In [26]:
print(df3['OPEN_INT'].dtype)

int64

In [27]:
df3['OPEN_INT'].dtype

dtype('int64')

## Saving processed DataFrames

### To CSV files

In [38]:
df4 = pd.DataFrame([[2,65,3,78],[23,76,8,2],[23,87,56,44],[23,76,87,45],[2,7,9,43]],columns=['A1','B1','C1','D1'])
# exporting csv file to the desired file location after making it from the DataFrame
# df4.to_csv('F:\\Programming\\Git_Materials\\DataHouse\\export.csv', index=False)
df4.to_csv('F:\\Programming\\Git_Materials\\DataHouse\\export.csv')

## Pandas - Operations

### Creating index for entities

In [45]:
df5 = pd.read_csv('F:\\Programming\\Git_Materials\\DataHouse\\district_covid_cases.csv')
# setting 'dname' as the index
df5.set_index('dname', inplace=True)
df5.head(5)

,sname,confirmed,dead,recovered,active
dname,,,,,
NICOBARS,ANDAMAN AND NICOBAR ISLANDS,0,0,0,0
NORTH AND MIDDLE ANDAMAN,ANDAMAN AND NICOBAR ISLANDS,1,0,1,0
SOUTH ANDAMAN,ANDAMAN AND NICOBAR ISLANDS,51,0,32,19
UNKNOWN,ANDAMAN AND NICOBAR ISLANDS,4368,60,4161,147
ANANTAPUR,ANDHRA PRADESH,65408,571,63715,1122

### Type and information about DataFrame

In [47]:
print("Type:\n",type(df5))
print("Information about the dataframe:",df5.info)

Type:
 <class 'pandas.core.frame.DataFrame'>
Information about the dataframe: <bound method DataFrame.info of                                                 sname  confirmed  dead  \
dname
NICOBARS                  ANDAMAN AND NICOBAR ISLANDS          0     0
NORTH AND MIDDLE ANDAMAN  ANDAMAN AND NICOBAR ISLANDS          1     0
SOUTH ANDAMAN             ANDAMAN AND NICOBAR ISLANDS         51     0
UNKNOWN                   ANDAMAN AND NICOBAR ISLANDS       4368    60
ANANTAPUR                              ANDHRA PRADESH      65408   571
...                                               ...        ...   ...
NORTH 24 PARGANAS                         WEST BENGAL      81377  1657
PASCHIM BARDHAMAN                         WEST BENGAL      10959   106
PASCHIM MEDINIPUR                         WEST BENGAL      15266   221
PURBA MEDINIPUR                           WEST BENGAL      15685   203
SOUTH 24 PARGANAS                         WEST BENGAL      26258   488

                          recovered  active
dname
NICOBARS                          0       0
NORTH AND MIDDLE ANDAMAN          1       0
SOUTH ANDAMAN                    32      19
UNKNOWN                        4161     147
ANANTAPUR                     63715    1122
...                             ...     ...
NORTH 24 PARGANAS             72871    6849
PASCHIM BARDHAMAN              9738    1115
PASCHIM MEDINIPUR             13325    1720
PURBA MEDINIPUR               14015    1467
SOUTH 24 PARGANAS             23296    2474

[286 rows x 5 columns]>

### Shape of a DataFrame

In [50]:
print("Shape of datafframe:",df5.shape)
# df5.drop_duplicates()
# print(df5.shape)

Shape of datafframe: (286, 5)

### Some operations on DataFrames...

In [52]:
# columns of DataFrames
print("Columns of dataframe:\t",df5.columns)

Columns of dataframe:	 Index(['sname', 'confirmed', 'dead', 'recovered', 'active'], dtype='object')

In [53]:
# rename the attributes of the dataframe
df5.rename(columns={'sname':'state_name'},inplace=True)
print("Columns of dataframe:\t",df5.columns)

Columns of dataframe:	 Index(['state_name', 'confirmed', 'dead', 'recovered', 'active'], dtype='object')

### Merging two DataFrames

In [54]:
df6 = pd.DataFrame([[2,6,8],[63,87,91],[4,8,1]], columns=['A','B','C'])
df6

    A   B   C
0   2   6   8
1  63  87  91
2   4   8   1

In [58]:
df7 = pd.DataFrame([[4,6,1],[63,86,91],[7,8,3]], columns=['X','Y','Z'])
df7

    X   Y   Z
0   4   6   1
1  63  86  91
2   7   8   3

In [59]:
df8 = pd.merge(df6, df7, left_on='B', right_on='Y')
df8

   A  B  C  X  Y  Z
0  2  6  8  4  6  1
1  4  8  1  7  8  3